{
  "background": "For use as a background color, in components such as Page and Frame backgrounds.",
  "background-hovered": "For use when an action or navigation is used on a background.",
  "background-pressed": "For use when an action or navigation is used on a background.",
  "background-selected": "For use in the selected item in navigation",
  "surface": "For use as a background color, in components such as Card, Modal, and Popover.",
  "surface-neutral": "For use as a background color in neutral badges.",
  "surface-neutral-hovered": "For use as a hovered background color in neutral badges.",
  "surface-neutral-pressed": "For use as a pressed background color in neutral badges.",
  "surface-neutral-disabled": "For use as a disabled background color in neutral badges.",
  "surface-neutral-subdued": "For use as a background color in neutral banners.",
  "surface-subdued": "For use as a subdued background color, in components such as Card, Modal, and Popover.",
  "surface-disabled": "For use as a surface color on disabled interactive elements such as option list items and action list items when in a disabled state.",
  "surface-hovered": "For use as a surface color on interactive elements such as resource list items and action list items when in a hovered state.",
  "surface-pressed": "For use as a surface color on interactive elements such as resource list items and action list items when in a pressed state.",
  "surface-depressed": "For use as a surface color on interactive elements such as resource list items and action list items when in a depressed state.",
  "surface-search-field": "For use as a background color, in components on surface elements such as SearchField",
  "backdrop": "For use as the background color of the backdrop component for navigation and modal. This color has an alpha of `0.5`.",
  "overlay": "For use as the background color of elements which lay on top of surfaces to obscure their contents. This color has an alpha of `0.5`.",
  "shadow-from-dim-light": "For use in building shadows for modals. This color has an alpha of `0.02`.",
  "shadow-from-ambient-light": "For use in building shadows for popovers, and cards. This color has an alpha of `0.05`.",
  "shadow-from-direct-light": "For use in building shadows for popovers and cards. This color has an alpha of `0.15`.",
  "hint-from-direct-light": "For use in building shadows scrollables.",
  "border": "For use as the default border on elements.",
  "border-neutral-subdued": "For use as the border on banners.",
  "border-hovered": "Used for borders on hovered interactive elements",
  "border-disabled": "Used for disabled borders on interactive elements",
  "border-subdued": "For use as a subdued border on elements.",
  "border-depressed": "For use as a border on depressed elements.",
  "border-shadow": "For use as an additional bottom border on elements.",
  "border-shadow-subdued": "For use as an additional, subdued bottom border on elements.",
  "divider": "For use as a divider between elements.",
  "icon": "For use as the fill color of icons.",
  "icon-hovered": "For use as the fill color of hovered icons.",
  "icon-pressed": "For use as the fill color of pressed icons.",
  "icon-disabled": "For use as the fill color of disabled icons.",
  "icon-subdued": "For use as the fill color of subdued icons.",
  "text": "For use as a text color.",
  "text-disabled": "For use as a disabled text color and as a placeholder text color.",
  "text-subdued": "For use as a subdued text color.",
  "interactive": "Used for links, plain buttons, and as the fill color for selected checkboxes and radio buttons.",
  "interactive-disabled": "Used for disabled links and plain buttons.",
  "interactive-hovered": "Used for hovered links and plain buttons.",
  "interactive-pressed": "Used for pressed links and plain buttons.",
  "icon-interactive": "For use as an interactive icon fill color",
  "focused": "For use in the focus ring on interactive elements.",
  "surface-selected": "For use as a surface color in selected interactive elements, in components such as action list and resource list.",
  "surface-selected-hovered": "For use as a surface color in selected interactive elements that are hovered, in components such as action list and resource list.",
  "surface-selected-pressed": "For use as a surface color in selected interactive elements that are pressed, in components such as action list and resource list.",
  "icon-on-interactive": "For use as a fill color for icons on interactive elements.",
  "text-on-interactive": "For use as a text color on interactive elements.",
  "action-secondary": "Used for secondary buttons and tertiary buttons, as well as in form elements as a background color and pontentially other secondary surfaces.",
  "action-secondary-disabled": "Used as a disabled state for secondary buttons",
  "action-secondary-hovered": "Used as a hovered state for secondary buttons",
  "action-secondary-pressed": "Used as a pressed state for secondary buttons",
  "action-secondary-depressed": "Used as a depressed state for secondary buttons",
  "action-primary": "Used as the background color for primary actions, and as the fill color for icons and the text color in navigation and tabs to communicate interaction states.",
  "action-primary-disabled": "Used as the background color for disabled primary actions, and as the fill color for icons and the text color in navigation and tabs to communicate interaction states.",
  "action-primary-hovered": "Used as the background color for hovered primary actions, and as the fill color for icons and the text color in navigation and tabs to communicate interaction states.",
  "action-primary-pressed": "Used as the background color for pressed primary actions, and as the fill color for icons and the text color in navigation and tabs to communicate interaction states.",
  "action-primary-depressed": "Used as the background color for pressed primary actions, and as the fill color for icons and the text color in navigation and tabs to communicate interaction states.",
  "icon-on-primary": "For use as a fill color for icons on primary actions. Not for use in icons on navigation and tabs.",
  "text-on-primary": "For use as a text color on primary actions. Not for use in text on navigation and tabs.",
  "text-primary": "For use as primary text color on background. For use in text in components such as Navigation.",
  "text-primary-hovered": "For use as primary hovered text color on background. For use in text in components such as Navigation.",
  "text-primary-pressed": "For use as primary pressed text color on background. For use in text in components such as Navigation.",
  "surface-primary-selected": "Used as a surface color to indicate selected interactive states in navigation and tabs.",
  "surface-primary-selected-hovered": "Used as a surface color to indicate selected interactive states that are hovered in navigation and tabs.",
  "surface-primary-selected-pressed": "Used as a surface color to indicate selected interactive states that are pressed in navigation and tabs.",
  "border-critical": "For use as a border on critical components such as an outline on interactive elements in an error state.",
  "border-critical-subdued": "For use as a border on critical components such as banners.",
  "border-critical-disabled": "For use as a disabled border on critical components such as banners, and as an outline on interactive elements in an error state.",
  "icon-critical": "For use as an icon fill color on top of critical elements.",
  "surface-critical": "For use as a surface color on critical elements including badges.",
  "surface-critical-subdued": "For use as a subdued surface color on critical elements including banners.",
  "surface-critical-subdued-hovered": "For use as a surface color on critical interactive elements including action list items in a hovered state.",
  "surface-critical-subdued-pressed": "For use as a surface color on critical interactive elements including action list items in a pressed state.",
  "surface-critical-subdued-depressed": "For use as a surface color on critical interactive elements including action list items in a depressed state.",
  "text-critical": "For use as a text color in inert critical elements such as exception list. Not for use as a text color on banners and badges.",
  "action-critical": "For use as the background color for destructive buttons, and as the background color for error toast messages.",
  "action-critical-disabled": "For use as the background color for disabled destructive buttons, and as the background color for error toast messages.",
  "action-critical-hovered": "For use as the background color for hovered destructive buttons, and as the background color for error toast messages.",
  "action-critical-pressed": "For use as the background color for pressed destructive buttons, and as the background color for error toast messages.",
  "action-critical-depressed": "For use as the background color for depressed destructive buttons, and as the background color for error toast messages.",
  "icon-on-critical": "For use as a fill color for icons on critical actions.",
  "text-on-critical": "For use as a text color on critical actions.",
  "interactive-critical": "For use as the text color for destructive interactive elements: links, plain buttons, error state of selected checkboxes and radio buttons, as well as a text color on destructive action list items. Not for use on critical banners and badges.",
  "interactive-critical-disabled": "For use as a text color in disabled destructive plain buttons, as well as a text color on destructive action list items. Not for use on critical banners and badges.",
  "interactive-critical-hovered": "For use as a text color in hovered destructive plain buttons, as well as a text color on destructive action list items. Not for use on critical banners and badges.",
  "interactive-critical-pressed": "For use as a text color in pressed destructive plain buttons, as well as a text color on destructive action list items. Not for use on critical banners and badges.",
  "border-warning": "For use as a border on warning components such as...",
  "border-warning-subdued": "For use as a border on warning components such as banners.",
  "icon-warning": "For use as an icon fill color on top of warning elements.",
  "surface-warning": "For use as a surface color on warning elements including badges.",
  "surface-warning-subdued": "For use as a subdued surface color on warning elements including banners.",
  "surface-warning-subdued-hovered": "For use as a subdued surface color on warning elements including banners.",
  "surface-warning-subdued-pressed": "For use as a subdued surface color on warning elements including banners.",
  "text-warning": "For use as a text color in inert critical elements such as exception list. Not for use as a text color on banners and badges.",
  "border-highlight": "For use as a border on informational components such as...",
  "border-highlight-subdued": "For use as a border on informational components such as banners.",
  "icon-highlight": "For use as an icon fill color on top of informational elements.",
  "surface-highlight": "For use as a surface color on information elements including badges.",
  "surface-highlight-subdued": "For use as a surface color on information elements including banners.",
  "surface-highlight-subdued-hovered": "For use as a surface color on information elements including banners.",
  "surface-highlight-subdued-pressed": "For use as a surface color on information elements including banners.",
  "text-highlight": "For use as a text color in inert informational elements. Not for use as a text color on banners and badges.",
  "border-success": "For use as a border on success components such as text inputs.",
  "border-success-subdued": "For use as a border on success components such as banners.",
  "icon-success": "For use as an icon fill color on top of success elements.",
  "surface-success": "For use as a surface color on success elements including badges.",
  "surface-success-subdued": "For use as a surface color on information elements including banners.",
  "surface-success-subdued-hovered": "For use as a surface color on information elements including banners.",
  "surface-success-subdued-pressed": "For use as a surface color on information elements including banners.",
  "text-success": "For use as a text color in inert success elements. Not for use as a text color on banners and badges.",
  "decorative-one-icon": "For use as a decorative icon color that is applied on a decorative surface.",
  "decorative-one-surface": "For use as a decorative surface color.",
  "decorative-one-text": "For use as a decorative text color that is applied on a decorative surface.",
  "decorative-two-icon": "For use as a decorative icon color that is applied on a decorative surface.",
  "decorative-two-surface": "For use as a decorative surface color.",
  "decorative-two-text": "For use as a decorative text color that is applied on a decorative surface.",
  "decorative-three-icon": "For use as a decorative icon color that is applied on a decorative surface.",
  "decorative-three-surface": "For use as a decorative surface color.",
  "decorative-three-text": "For use as a decorative text color that is applied on a decorative surface.",
  "decorative-four-icon": "For use as a decorative icon color that is applied on a decorative surface.",
  "decorative-four-surface": "For use as a decorative surface color.",
  "decorative-four-text": "For use as a decorative text color that is applied on a decorative surface.",
  "decorative-five-icon": "For use as a decorative icon color that is applied on a decorative surface.",
  "decorative-five-surface": "For use as a decorative surface color.",
  "decorative-five-text": "For use as a decorative text color that is applied on a decorative surface."
}
